cask_args appdir: '/Applications'

tap 'homebrew/bundle'
tap 'hashicorp/tap'

# essential
cask '1password'
cask '1password-cli'
cask 'firefox'
cask 'google-chrome'
cask 'iterm2'
cask 'omnifocus'
cask 'private-internet-access'

# utilities
brew 'curl'
brew 'git'
brew 'gpg2'
brew 'tree'
brew 'wget'

# development
brew 'pre-commit'
brew 'gh'
brew 'mise'
brew 'hashicorp/tap/terraform'
# brew 'kubernetes-cli', link: false
# brew 'pinentry-mac'

# postgresql development headers
brew 'libpq'

# text
cask 'espanso'
cask 'rectangle-pro'
cask 'joplin'
brew 'neovim'
cask 'sublime-text'

# misc
brew 'neofetch'
brew 'ffmpeg'
# cask 'transmission'
# cask 'transmission-remote-gui'

# ruby

brew 'autoconf'
brew 'gmp'
brew 'libyaml'
brew 'openssl@3'
brew 'readline'

# work related
cask 'google-cloud-sdk'
brew 'sops'
cask 'slack'
cask 'zoom'
