cask_args appdir: "/Applications"

tap "homebrew/cask"
tap "heroku/brew"

cask "1password"
cask "firefox"
cask "google-chrome"
cask "google-cloud-sdk"
cask "iterm2"
cask "macdown"
cask "slack"
cask "sublime-text"
cask "transmission"
cask "transmission-remote-gui"

brew "gpg2"
brew "heroku/brew/heroku"
brew "kubernetes-cli", link: false
brew "pinentry-mac"
brew "qcachegrind"
brew "rbenv"
brew "ruby-build"
brew "tree"
brew "terraform"
brew "wget"
brew "yarn"

