cask_args appdir: '/Applications'

tap 'homebrew/cask'
tap 'heroku/brew'
tap 'homebrew/bundle'
tap 'homebrew/core'

cask '1password'
cask 'firefox'
cask 'google-chrome'
cask 'google-cloud-sdk'
cask 'iterm2'
cask 'macdown'
cask 'slack'
cask 'sublime-text'
cask 'transmission'
cask 'transmission-remote-gui'

brew 'coreutils'
brew 'curl'
brew 'gh'
brew 'git'
brew 'gpg2'
brew 'heroku/brew/heroku'
brew 'kubernetes-cli', link: false
brew 'pinentry-mac'
brew 'qcachegrind'
brew 'terraform'
brew 'tree'
brew 'wget'

# brew "unbound"
# brew "gnutls"
# brew "gnupg"
# brew "neofetch"
# brew "neovim"
# brew "pre-commit"
# brew "python@3.10"
# brew "rcm"
# brew "sops"
# cask "google-cloud-sdk"
